OdRxValueType.equalTo(System.Void!System.Runtime.CompilerServices.IsConst*,System.Void!System.Runtime.CompilerServices.IsConst*)
\details
Compares two values of the underlying C++ type.
\param a [in] First value to compare.
\param b [in] Second value to compare.
\returns
true if compared values are equal; false otherwise.

OdRxValueType.toString(System.Void!System.Runtime.CompilerServices.IsConst*,OdRxValueType.StringFormat)
\details
Converts a value to a string.
\param instance [in] Instance of the value to convert.
\param format   [in] Defines the format of the resulting string.
\returns
Converted value.
\remarks
Mostly for debug purposes.

OdRxValueType.typePath(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retreives an ANSI string in format of path that elaborates the sense of
value of the value type. Can be interpreted additionally when working with
RxValue.
\param instance [in] Value, the sense of which must be clarified.
\returns
ANSI string with clarification of value sense.

OdRxValueType.fromValueType(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts a value from the specified type (type of the "from" value) to this
type.
\param from      [in] Value of type to convert from.
\param instance [out] Resulting value of "this" type.
\returns
true if conversion is possible. Otherwise false.

OdRxValueType.toValueType(OdRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts a value to the specified type from this type.
\param vt       [in] Type to convert to.
\param instance [in] Value of "this" type.
\param result  [out] Resulting value of the type specified in vt.
\returns
true if conversion is possible. Otherwise false.

OdRxValueType.create
\details
Creates a new OdRxValue of this type, wrapped in an OdRxBoxedValue (if you need a
smart pointer).
\returns
Created OdRxBoxedValue object containing an OdRxValue object of this type.

OdRxValueType.createValue
\details
Creates a new wrapped value of this type.
\returns
Created wrapped value of this type.

OdRxValueType.rxObjectValue
\details
Returns the interface, that describes OdRxObject-descendant pointers.
\returns
Interface, describing OdRxObject-descendant pointers. NULL for types other
than OdRxObject-descendant pointers.

OdRxValueType.reference
\details
Returns the interface, that describes references (handlers).
\returns
Interface, describing references. NULL for non-reference types.

OdRxValueType.enumeration
\details
Returns the interface, that describes enumeration.
\returns
Interface, describing enumeration. NULL for non-enumeration types.

OdRxValueType.nonBlittable
\details
Returns the interface, that handles copying/destroying values for non-POD
types.
\returns
Interface, handling copying/destroying values for non-POD types. NULL for
POD types.

OdRxValueType.isAggregate
\details
Indicates whether the value type is SDAI aggregate data type.
\returns
true for SDAI aggregate data type. For other types false.

OdRxValueType.isSelect
\details
Indicates whether the value type is SDAI select data type.
\returns
true for SDAI select data type. For other types false.

OdRxValueType.isReference
\details
Indicates whether the value type is handler.
\returns
true for object handlers value types, like OdDbObjectId. For other
value types false.

OdRxValueType.isEnum
\details
Indicates whether the value type is enumeration.
\returns
true for the enumerations. For other types false.

OdRxValueType.isBlittable
\details
Indicates whether the value type is blittable.
\returns
true for the POD types (value may be copied by memcpy). For other types false.

OdRxValueType.size
\details
Returns the amount of memory to store the value of the type (like sizeof(T)).
\returns
Amount of memory to store the value of the type. (sizeof(T))

OdRxValueType.op_Inequality(OdRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Negative comparison operator.
\param rhs [in] Value type to compare with the current value type.
\returns
true if value types are not equal; false otherwise.

OdRxValueType.op_Equality(OdRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator.
\param rhs [in] Value type to compare with the current value type.
\returns
true if value types are equal; false otherwise.

OdRxValueType.Dispose
\details
Destroys the objects of the OdRxValueType class.